/*
Amdahl定律相关

1.1
Information:
1.2500km, 100km/h, 25h
2.其中有1500km可以150km/h

Question:
计算加速比?

A
solution:
1.Total time = 25 *(1000/2500) + 1500/150 = 20h
2.加速比 = 25/20 = 1.25

B
Infomation:
1.可加速区域为1500km, 要求加速比为1.67,需要多块到速度通过加速区域

solution:
1.加速后的总时间 = 25/1.67 = 14.97h

2.根据公式:
14.97 = 10 + 1500/speed
那么speed = 1500/4.97 = 302km/h


1.2
Information:
1.软件性能要求改进2X
2.已经确定整个系统只有80%能够改进

Question:
1.能改进的部分需要提高多少才能达到目标?

solution:
1.根据公式:
oldtime=2,newtime=1
80%可改进部分的原有时间:1.6
80%可改进部分的要求时间:0.6
80%可改进部分的K=1.6/0.6=2.67

*/


